АлогистикТест2/src/Documents/алк_СборкаЗапасов/алк_СборкаЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_СборкаЗапасов</name>
  <registerRecords>AccumulationRegister.алк_ВыпускПродукцииСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыКПоступлениюНаСкладыСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_МатериалыЗатратыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>AccumulationRegister.алк_УчетЛесопродукцииГОСТ</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиБиржа</registerRecords>
  <registerRecords>InformationRegister.алк_ПакетыИсторияЗаказов</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <registerRecords>AccumulationRegister.алк_Отходы</registerRecords>
  <registerRecords>AccumulationRegister.алк_ВыпускОтходы</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПиломатериалыПереданныеНаСушку</registerRecords>
  <registerRecords>InformationRegister.алк_ПараметрыПакетов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаЗапасов</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаЗапасов</name>
    <type>
      <types>CatalogRef.Ячейки</types>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПродукции</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПродукции</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийСборкаЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ПропускатьМинусЗапасы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Автозаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоРазделитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныеНомера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаПроизводство</name>
      <type>
        <types>DocumentRef.алк_ЗаказНаПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.алк_ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоРазделитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаГОСТ</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоГОСТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемГОСТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомераПродукция</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отходы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.Ячейки</types>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ДополнительныеНастройки/алк_ДополнительныеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ДополнительныеНастройки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Строка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/AccumulationRegisters/алк_ВыпускПродукцииСерии/алк_ВыпускПродукцииСерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ВыпускПродукцииСерии</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоПакетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/InformationRegisters/алк_ДополнительныеПараметрыПакетов/алк_ДополнительныеПараметрыПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ДополнительныеПараметрыПакетов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВидШпона</name>
    <type>
      <types>EnumRef.алк_ВидыШпона</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>СлойДревесины</name>
    <type>
      <types>EnumRef.алк_СлойДревесины</types>
    </type>
  </resources>
  <resources>
    <name>СортированныйПакет</name>
    <comment>из какого пакета была упаковка</comment>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </resources>
  <resources>
    <name>УчастокВыпуска</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </resources>
  <resources>
    <name>Досушка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Переупаковка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БоковаяДоска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.алк_УпаковкаНоменклатуры</types>
      <types>DocumentRef.алк_РучноеИзменениеДополнительныхПараметровПакета</types>
      <types>DocumentRef.алк_РучноеИзменениеПараметровПакета</types>
      <types>DocumentRef.алк_СборкаЗапасов</types>
      <types>DocumentRef.алк_Производство</types>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Documents/алк_СборкаЗапасов/ObjectModule.bsl
#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
		
		ПараметрыСмены = Новый Структура("ДатаСмены, Смена", ДатаСмены, Смена); 
		
		Дата = РфпСервер.ПолучитьДатуВремяПоВидуДокумента(ПараметрыСмены, ЭтотОбъект.Ссылка.Метаданные().Имя);
		
	КонецЕсли;    
	
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		//Соберем массив для контроля остатков  
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|  алк_ОстаткиЗапасов.СерийныйНомер
		|ИЗ
		|  РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
		|ГДЕ
		|  алк_ОстаткиЗапасов.Регистратор = &Регистратор
		|  И НЕ алк_ОстаткиЗапасов.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("Регистратор", Ссылка);  
		РезультатЗапроса = Запрос.Выполнить();  
		Выборка = РезультатЗапроса.Выгрузить();
		
		МассивСНДоЗаписи = Выборка.ВыгрузитьКолонку("СерийныйНомер");
		
		ДополнительныеСвойства.Вставить("МассивСНДоЗаписи", МассивСНДоЗаписи);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьТабличнуюЧасть(Отказ);
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	Документы.алк_СборкаЗапасов.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	РфпСервер.ОтразитьПараметрыПакетов(ДополнительныеСвойства, Движения, Отказ);
	РфпСервер.ОтразитьДополнительныеПараметрыПакетов(ДополнительныеСвойства, Движения, Отказ);
	РфпСервер.ОтразитьЗапасыКПоступлениюНаСкладыСерии(ДополнительныеСвойства, Движения, Отказ);
	РфпСервер.ОтразитьМатериалыЗатратыВыпуска(ДополнительныеСвойства, Движения, Отказ);
	РфпСервер.ОтразитьВыпускПродукции(ДополнительныеСвойства, Движения, Отказ); // Поштучно
	РфпСервер.ОтразитьВыпускОтходы(ДополнительныеСвойства, Движения, Отказ);
	РфпСервер.ОтразитьЗапасыОрганизации(ДополнительныеСвойства, Движения, Отказ); 
	РфпСервер.ОтразитьОтходыВЗапасахОрганизации(ДополнительныеСвойства, Движения, Отказ);//Добавил Страшко
	//РФПСервер.ОтразитьПиломатериалыПереданныеНаСушку(ДополнительныеСвойства, Движения, Отказ);
	//РФПСервер.ОтразитьОстаткиНезавершенногоПроизводства(ДополнительныеСвойства, Движения, Отказ);
	//Сергеева Г.О. Оборотный регистр ++  
	РфпСервер.ОтразитьОборотыПроизводства(ДополнительныеСвойства, Движения, Отказ);  			
	//Сергеева Г.О. Оборотный регистр --
	
	
	ЗаписыватьДвиженияВНовыеРегистры = РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата);  
	
	
	// проверка на переход на новые регистры, после перехода данный документ не делает движения по новым регистрам
	// т.к. движения создаются стандартным документом производства при упаковке пакета.  
	// разделено по участкам, МЛП и ЦЛП, чтоб разнести перенос  
	
	Если Участок.Код = "000000004"              // УЧАСТОК ПФМ (1 ЛИНИЯ)
		Или Участок.Код = "000000026" 		 	// УЧАСТОК ПФМ (2 ЛИНИЯ)
		Или Участок.Код = "000000002" 		 	// ЛИНИЯ ПИЛЕНИЯ LINCK -  т.к. этот участок используется при автозаполнении документов. 
		Или Участок.Код = "000000046" Тогда		// Участок малой пересортировки  	
		ПараметрНастройки = "ДатаПерехода_ЦЛП";	 	
	ИначеЕсли Участок.Код = "000000044" Тогда      						// МЛП   
		ПараметрНастройки = "ДатаПерехода_МЛП";  	
	ИначеЕсли     
		Участок.Код = "000000010"               // ЛИНИЯ ЛУЩЕНИЯ №1
		Или Участок.Код = "000000011" 		 	// ЛИНИЯ ЛУЩЕНИЯ №2
		Или Участок.Код = "000000012" Тогда     // ЛИНИЯ ЛУЩЕНИЯ №3
		ПараметрНастройки = "ДатаПерехода_ЦПШ";
	Иначе
		ПараметрНастройки = "Заглушка";          
	КонецЕсли;
	
	СтруктураНастроек = Новый Структура("Параметр", ПараметрНастройки);
	ПолучитьДатуВвода = РегистрыСведений.алк_ДополнительныеНастройки.СрезПоследних(,СтруктураНастроек);
	ДатаВвода = Дата("23001201");
	Если ПолучитьДатуВвода.Количество() > 0 Тогда
		ДатаВвода = ПолучитьДатуВвода[0].Дата;
	КонецЕсли;
	
	Если ДатаВвода <= ДатаСмены Тогда
		ЗаписыватьДвиженияВНовыеРегистры = Ложь;
	КонецЕсли;  	

	
	//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов ++
	Если ЗаписыватьДвиженияВНовыеРегистры Тогда  	
		РфпСервер.ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов --
	
	//Сергеева Г.О. ++
	РфпСервер.ОтразитьОстаткиЛесопродукции(ДополнительныеСвойства, Движения, Отказ);
	//Сергеева Г.О. --
	
	Если Направление = Перечисления.алк_НаправленияДеятельности.Отходы И ДатаСмены >= '2017-10-01' Тогда
		РфпСервер.ОтразитьОтходы(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	
	Если Запасы.Количество() <> 0 Тогда
		// Отражение по "Последовательностям"
		РфпСервер.ОтразитьДокументыПоследовательностиБиржа(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли; 
	
	// СерийныеНомера
	УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
	РфпСервер.ОтразитьПакетыИсторияЗаказов(ДополнительныеСвойства, Движения, Отказ);
	
	// регистр алк_ВыпускПродукции Приход
	Движения.алк_ВыпускПродукцииСерии.Записывать = Истина;
	Движения.алк_ВыпускПродукцииСерии.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_СборкаЗапасовПродукция.Номенклатура,
	|	алк_СборкаЗапасовПродукция.Характеристика,
	|	алк_СборкаЗапасовСерийныеНомераПродукция.СерийныйНомер,
	|	алк_СборкаЗапасовПродукция.Ссылка.Организация,
	|	алк_СборкаЗапасовПродукция.Ссылка.ДатаСмены,
	|	алк_СборкаЗапасовПродукция.Ссылка.Смена,
	|	алк_СборкаЗапасовПродукция.ЗаказНаПроизводство.ДокументОснование КАК ЗаказПокупателя,
	|	1 КАК КоличествоПакетов,
	|	&Период
	|ИЗ
	|	Документ.алк_СборкаЗапасов.Продукция КАК алк_СборкаЗапасовПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_СборкаЗапасов.СерийныеНомераПродукция КАК алк_СборкаЗапасовСерийныеНомераПродукция
	|		ПО алк_СборкаЗапасовПродукция.КлючСвязи = алк_СборкаЗапасовСерийныеНомераПродукция.КлючСвязи
	|ГДЕ
	|	алк_СборкаЗапасовПродукция.Ссылка = &Ссылка
	|	И алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка = &Ссылка";
	
	//Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Движения.алк_ВыпускПродукцииСерии.Загрузить(РезультатЗапроса.Выгрузить());
	
	// Регистр сведений алк_ПараметрыПакетов
	Движения.алк_ПараметрыПакетов.Записывать = Истина;
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	//Документы.алк_СборкаЗапасов.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
	// Контроль (временно)
	// ОтказПоКонтролю = Контроль(Режим, ДополнительныеСвойства, ВидОперации);
	
	Если ДополнительныеСвойства.Свойство("Обработка","УниверсальныеПодборИОбработкаОбъектовУФ") Тогда 
		ПропускатьМинусЗапасы = Истина;
	КонецЕсли;
	
	ОтказПоКонтролю = Ложь;
	
	// 06.11.2023 - Пакушев И.С. временное откоючение контроля.  
	// т.к. отгружают прято с цеха, по времени возникают расхождения. 
	
	
	
	Если ЗаписыватьДвиженияВНовыеРегистры Тогда  
		// Контроль остатков
		Движения.алк_ОстаткиЗапасов.Записать(); 
		////////////////////////////////////////
		//Если Ложь Тогда	  
		РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ);  
		//КонецЕсли;
		////////////////////////////////////////
		//\\
	Иначе	
		//ОтказПоКонтролю = РфпСервер.КонтрольОтрицательныхостатковПоРегистру(РежимПроведения, ДополнительныеСвойства, "алк_ЗапасыОрганизации"); 
	КонецЕсли;
	
	ОтказПоДублям = КонтрольДублей(РежимПроведения, ДополнительныеСвойства);
	
	
	////////////////////////////////////////
	//Если Ложь Тогда	 
	Если (ОтказПоКонтролю ИЛИ ОтказПоДублям) И Не ПропускатьМинусЗапасы Тогда
		
		Отказ = Истина;
		
	КонецЕсли; 		
	//КонецЕсли;
	////////////////////////////////////////
	
	
	
	
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть(); 		
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.ОтменаПроведения); 
	
	Если Отказ Тогда  
		Возврат;
	КонецЕсли;
	
	Для Каждого эл ИЗ СерийныеНомераПродукция Цикл  
		РегистрыСведений.алк_ДополнительныеПараметрыПакетов.УдалитьЗаписьВРегистре(эл.СерийныйНомер,Ссылка);
	КонецЦикла;
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаЗаполнения.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ЗаполнитьПоДокументамОснованиям") Тогда
		
		Если ДанныеЗаполнения.ЗаполнитьПоДокументамОснованиям Тогда
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, "ОбработчикЗаполнения");
		КонецЕсли; 
		
	Иначе
		
		СтратегияЗаполнения = Новый Соответствие;
		СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
		//СтратегияЗаполнения[Тип("ДокументСсылка.алк_РасходнаяНакладная")] = "ЗаполнитьПоРасходнойНакладной";
		
		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);	
		
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти 

Процедура ПроверитьТабличнуюЧасть(Отказ)  
	
	ОграничениеПоВесу = 1250;  // вынес в переменную чтоб можно было обойти при отладке
	
	Для каждого СтрокаТабличнойЧасти из ЭтотОбъект.Продукция цикл
		
		Если СтрокаТабличнойЧасти.Количество > ОграничениеПоВесу тогда  // простое условие чтоб не гонять на сервер, для больше части номенклатуры его достаточно 
			
			Если ЭтотОбъект.ДатаСмены = '20240311' Тогда					
				Возврат;  		    			
			КонецЕсли;
			
			МаксимальныйВесТары = ПолучитьМаксимальныйВесДляТары(СтрокаТабличнойЧасти.Характеристика);  	
			
			Если МаксимальныйВесТары < СтрокаТабличнойЧасти.Количество Тогда
				
				Сообщить( "Упаковка, с серийным номером " + СтрокаТабличнойЧасти.СерийныеНомера + " не может превышать " + МаксимальныйВесТары + " кг");
				Отказ = Истина; 
				
			КонецЕсли;  
		КонецЕсли;
		
	КонецЦикла;  	
	
КонецПроцедуры 	

Функция ПолучитьМаксимальныйВесДляТары(Характеристика) 
	
	Если Характеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду("000048202") Тогда   // упаковка 0,65 т. 	
		Возврат 1250;	                                                                                             		
	ИначеЕсли Характеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду("000048203") Тогда   // упаковка 1,00 т. 
		Возврат 1250;
	ИначеЕсли Характеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду("000048629") Тогда   // упаковка 14,00 т. 
		Возврат 14250;	
	Иначе
		Возврат 60250;  // остается вагон хоппер	
	КонецЕсли; 
	
КонецФункции



#Область ПроцедурыЗаполненияДокумента

// Обработчик заполнения документа по структуре
//
// Параметры:
//
Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
	
	//Если ДанныеЗаполнения.Свойство("Основание") Тогда
	//	
	//КонецЕсли;
	
	//Если ДанныеЗаполнения.Свойство("Заказ") Тогда
	//	Заказ = ДанныеЗаполнения.Заказ;	
	//КонецЕсли; 
	//
	//Если ДанныеЗаполнения.Свойство("ВидТранспортировки") Тогда
	//	ВидТранспортировки = ДанныеЗаполнения.ВидТранспортировки;	
	//КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти


#Область Контроль

Функция Контроль(РежимПроведения, ДополнительныеСвойства, ДокументВидОперации)
	
	Если Истина Тогда
		
		ДокТЧ = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыОрганизации;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокТЧ.Номенклатура,
		|	ДокТЧ.Характеристика,
		|	ДокТЧ.Организация,
		|	ДокТЧ.СтруктурнаяЕдиница,
		|	ДокТЧ.Ячейка
		|ПОМЕСТИТЬ втДокТЧ
		|ИЗ
		|	&ДокТЧ КАК ДокТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЗапасыОрганизацииОстатки.КоличествоОстаток,
		|	алк_ЗапасыОрганизацииОстатки.Номенклатура,
		|	алк_ЗапасыОрганизацииОстатки.Характеристика
		|ИЗ
		|	РегистрНакопления.алк_ЗапасыОрганизации.Остатки(
		|			&МоментИтогов,
		|			(Номенклатура, Характеристика, Организация, СтруктурнаяЕдиница, Ячейка) В
		|				(ВЫБРАТЬ
		|					ДокТЧ.Номенклатура,
		|					ДокТЧ.Характеристика,
		|					ДокТЧ.Организация,
		|					ДокТЧ.СтруктурнаяЕдиница,
		|					ДокТЧ.Ячейка
		|				ИЗ
		|					втДокТЧ КАК ДокТЧ)) КАК алк_ЗапасыОрганизацииОстатки
		|ГДЕ
		|	алк_ЗапасыОрганизацииОстатки.КоличествоОстаток < 0";
		
		Запрос.УстановитьПараметр("ДокТЧ", ДокТЧ);
		
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			МоментИтогов = '00010101';
		Иначе
			МоментИтогов = Новый Граница(МоментВремени(), ВидГраницы.Включая);
		КонецЕсли; 
		
		Запрос.УстановитьПараметр("МоментИтогов", МоментИтогов);
		
		РезультатПоОстаткам = Запрос.Выполнить();  // РезультатПоОстаткам.Выгрузить()
		
		Если НЕ РезультатПоОстаткам.Пустой() Тогда
			
			ВыборкаДетальныеЗаписи = РезультатПоОстаткам.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не хватает запасов: " + ВыборкаДетальныеЗаписи.Характеристика;
				Сообщение.Сообщить();	
				
			КонецЦикла;
			
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция КонтрольДублей(РежимПроведения, ДополнительныеСвойства)
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ПараметрыПакетов.СерийныйНомер,
	|	СУММА(1) КАК Счетчик
	|ПОМЕСТИТЬ втРезультат
	|ИЗ
	|	РегистрСведений.алк_ПараметрыПакетов КАК алк_ПараметрыПакетов
	|ГДЕ
	|	алк_ПараметрыПакетов.СерийныйНомер В(&СерийныйНомера)
	|	И НЕ(алк_ПараметрыПакетов.Регистратор ССЫЛКА Документ.алк_РучноеИзменениеПараметровПакета
	|				ИЛИ алк_ПараметрыПакетов.Регистратор ССЫЛКА Документ.алк_ВыгрузкаИзСушильнойКамеры)
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ПараметрыПакетов.СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРезультат.СерийныйНомер,
	|	втРезультат.Счетчик
	|ИЗ
	|	втРезультат КАК втРезультат
	|ГДЕ
	|	втРезультат.Счетчик > 1";
	
	Запрос.УстановитьПараметр("СерийныйНомера", ДополнительныеСвойства.ДляПроведения.Ссылка.СерийныеНомераПродукция.Выгрузить(, "СерийныйНомер"));
	
	РезультатЗапроса = Запрос.Выполнить(); // РезультатЗапроса.Выгрузить()
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Дублируются пакеты!";
		Сообщение.Сообщить(); 
		
	КонецЕсли; 	
	
	Возврат Отказ;
	
КонецФункции

#КонецОбласти


#Область ПроцедурыЗаполненияТЧ

&НаСервере
Процедура ЗаполнитьПродукциюПоДаннымРегистра(ЗакрытиеСмены = Ложь) Экспорт
	
	Продукция.Очистить();
	СерийныеНомераПродукция.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.Период,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.СерийныйНомер КАК СерийныйНомер,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.Актуальность,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.НомерПакета,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.ПериодПакета,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.КоличествоСостав,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.Объем,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.Характеристика,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.СертификатFSC,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.ОбъемТаможня,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.ВесНеттоТаможня,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.ВесБруттоТаможня,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.ЗаказНаПроизводство,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.ПериодУпаковки,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.ДатаСмены,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.Смена,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.Ответственный,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.СерийныйНомер.Владелец КАК Номенклатура,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.Сертификат
	|ИЗ
	|	РегистрСведений.алк_ПараметрыПакетовОперативный.СрезПоследних(
	|			,
	|			ДатаСмены = &ДатаСмены
	|				И Смена = &Смена
	|				И Актуальность = &Актуальность
	|				И Направление = &Направление
	|				И Участок В (&Участок)) КАК алк_ПараметрыПакетовОперативныйСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	СерийныйНомер";
	
	Запрос.УстановитьПараметр("Актуальность", Перечисления.алк_ОперативнаяАктуальностьПакетов.Актуален);
	Запрос.УстановитьПараметр("ДатаСмены", ДатаСмены);
	Запрос.УстановитьПараметр("Смена", Смена);
	Запрос.УстановитьПараметр("Направление", Направление); 
	
	Если ЗакрытиеСмены Тогда			
		
		Участки = Новый Массив;
		Участки.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000004")); //УЧАСТОК ПФМ И УПАКОВКА (1 ЛИНИЯ) 
		Участки.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000026")); //УЧАСТОК ПФМ И УПАКОВКА (2 ЛИНИЯ)
		Участки.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000002")); //ЛИНИЯ ПИЛЕНИЯ LINCK  			
		
		Запрос.УстановитьПараметр("Участок", Участки);
		
	Иначе		
		
		Запрос.УстановитьПараметр("Участок", Участок);
		
	КонецЕсли; 	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	КлючСвязи = 1;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		
		НоваяСтрокаСН = СерийныеНомераПродукция.Добавить();
		НоваяСтрокаСН.КлючСвязи 	= КлючСвязи;
		НоваяСтрокаСН.СерийныйНомер = ВыборкаДетальныеЗаписи.СерийныйНомер;
		
		НоваяСтрокаПродукция = Продукция.Добавить();
		
		НоваяСтрокаПродукция.КлючСвязи 		= КлючСвязи;
		НоваяСтрокаПродукция.Номенклатура 	= ВыборкаДетальныеЗаписи.Номенклатура; 
		НоваяСтрокаПродукция.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
		НоваяСтрокаПродукция.Количество 	= ВыборкаДетальныеЗаписи.КоличествоСостав;
		НоваяСтрокаПродукция.Объем 			= ВыборкаДетальныеЗаписи.Объем;
		НоваяСтрокаПродукция.СерийныеНомера = ВыборкаДетальныеЗаписи.СерийныйНомер.Наименование;
		НоваяСтрокаПродукция.Сертификат 	= ВыборкаДетальныеЗаписи.Сертификат;
		
		НоваяСтрокаПродукция.ЗаказНаПроизводство = ВыборкаДетальныеЗаписи.ЗаказНаПроизводство;
		
		КлючСвязи = КлючСвязи + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПустуюТаблицуДвижений()
	
	ТаблицаДвижений = Новый ТаблицаЗначений;
	
	ТаблицаДвижений.Колонки.Добавить("ВидДвижения");
	ТаблицаДвижений.Колонки.Добавить("ВидДвиженияПроизводства");
	ТаблицаДвижений.Колонки.Добавить("Номенклатура");
	ТаблицаДвижений.Колонки.Добавить("Характеристика");
	ТаблицаДвижений.Колонки.Добавить("СерийныйНомер");
	ТаблицаДвижений.Колонки.Добавить("Сертификат");
	ТаблицаДвижений.Колонки.Добавить("Количество");
	ТаблицаДвижений.Колонки.Добавить("Период"); 			
	ТаблицаДвижений.Колонки.Добавить("ДатаСмены");
	ТаблицаДвижений.Колонки.Добавить("Бригада");
	ТаблицаДвижений.Колонки.Добавить("Участок");
	ТаблицаДвижений.Колонки.Добавить("Операция"); 				
	ТаблицаДвижений.Колонки.Добавить("Организация"); 
	ТаблицаДвижений.Колонки.Добавить("Смена"); 				
	ТаблицаДвижений.Колонки.Добавить("СтруктурнаяЕдиница"); 
	ТаблицаДвижений.Колонки.Добавить("Склад");
	
	Возврат ТаблицаДвижений;
	
КонецФункции	

#КонецОбласти
